{"pageProps":{"Post":{"id":"dcd135d3-9ac2-445b-83aa-6a3ffb00d0f3","contentHtml":"<h2>Choose a Learning Path</h2>\n<p>My interests are wide-spanning and although they reside within the broad area of technology, they usually require different skills.</p>\n<p>Each interest also requires time, planning, and organisation.</p>\n<p>I've been considering recently how to best optimise my learning so that I can build up momentum. After watching a video from <a href=\"https://www.youtube.com/watch?v=sO1ctUNQ1k8\">Devslopes</a> I realised that I'm having challenges with learning because my learning is not done towards a path, a singular goal.</p>\n<h2>Background</h2>\n<p>Like most people I hated school. It prescribed too much of what I had to learn and didn't do a great job of relating that with why I'm learning it and how it can benefit me.</p>\n<p>Most of the topics I loved were topics that had decent teachers. Those teachers were in equal parts educators and actors, they knew exactly how to spark curiosity and wonder whilst also allowing me the freedom to make my own mind on it.</p>\n<p>I was glad to finish school because finally, at university, I was pursuing something I liked. In hindsight university is where you first encounter the idea of learning for a path: you enrol in a course, you set your target on an industry and you slowly find a sub-category of work that you enjoy. This freedom meant that whilst following a business degree I could also pursue learning Japanese, sociology, service design, and advertising.</p>\n<p>In university I started joining different clubs and branching out my interests. This helped me avoid boredom, fight off the loneliness of being a foreign student, introduced me to new people, and helped learn some valuable life skills.</p>\n<p>It did have a negative impact: I started to identify myself as a polymath.</p>\n<h2>The challenge</h2>\n<p>A polymath or a person with multiple interests believe that they can be good at a few things. They are 'Jack of all trades'.</p>\n<p>I read once that a huge chunk of learners never become experts in a field because they become too addicted to being a beginner. As soon as they come close to mastery, they either start misjudge their experience or find new topics to learn.</p>\n<p>The main issue I have is that having multiple interests, although exciting, leaves me with too much planning. If I were to focus on electronics, I could focus on this until I reach mastery.</p>\n<p>Ultimately it comes down to choices and the more choices you have the higher the cost of making decision.</p>\n<h2>Inspiration</h2>\n<p><a href=\"https://www.youtube.com/watch?v=sO1ctUNQ1k8\">Devslopes</a> was tackling the question 'Should I learn Python in 2021' and the conclusion was 'No' because learning Python isn't part of a path that can get a beginner into the industry.</p>\n<h2>Tools and process</h2>\n<p>Because of the multiple interests I've already developed some systems to manage my interests.</p>\n<p>The most useful tool for validating new skills has been the 'learning radar' inspired by the <a href=\"https://www.thoughtworks.com/radar\">Thoughworks Tech Radar</a>.</p>\n<p>Every year I decide what skills, tech, tools, practices, languages &#x26; frameworks I want to hold, assess, trial, adopt.</p>\n<p>For each entry in the radar I plan quarterly goals, and from there I set a mastery target. Eg. By Q1 2021 I want to get an AWS certification.</p>\n<p>The quarterly goals then get slip to weekly time slots. I time-box a lot and I find it really useful when learning.</p>\n<h2>Assessing the process</h2>\n<p>The biggest issue with the process is that my 'learning radar' is huge, which has a knock-on effect on the amount of time I can allocate to each entry.</p>\n<p>This mean that it takes me longer to reach mastery for each entry.</p>\n<p>Some entries, like calculus require vastly more energy than something like web development because of the ratio of skill/complexity for that entry. I'm a lot more experienced at web development so it's easier to complete goals for that entry.</p>\n<h2>Refactoring the process</h2>\n<p>Started by zooming out from the 'learning radar' and considering the 'paths' of each entry.</p>\n<ul>\n<li>\n<p>'Learning Python' aligns with 'Machine Learning Engineer' and 'Web Security Engineer' and 'Automation Engineer (Network or DevOps)' paths.</p>\n</li>\n<li>\n<p>'Learning Rust' aligns with 'Embedded Engineer' and 'Robotics Engineer' paths.</p>\n</li>\n<li>\n<p>'Learning Calculus' aligns with 'Machine Learning Engineer' and 'Robotics Engineer' paths.</p>\n</li>\n</ul>\n<p>After mapping each entry to a path patterns start to develop.</p>\n<p>I realises that some entries are shared by multiple paths, so I settle on the rule of only adding something new to the 'learning radar' if it aligns to 2 or more paths.</p>\n<p>As hard as it is I decide to drop all other entries that don't match the above rule.</p>\n<p>A small sample of learning entries I dropped:</p>\n<ul>\n<li>WebGL</li>\n<li>Vue</li>\n<li>Electron</li>\n<li>Flask</li>\n<li>Swift</li>\n<li>Kotlin</li>\n<li>Flutter</li>\n</ul>\n<h2>What paths am I following</h2>\n<ul>\n<li>Software Engineer with focus on Web and Cloud</li>\n<li>Machine Learning Engineer with focus on economic models and satellite imagery</li>\n<li>SysOps Engineer with a focus DevOps and Networking</li>\n<li>Security Engineer with a focus on Web Security</li>\n<li>Embedded Engineer with a focus on human machine interfaces and sensors</li>\n<li>Robotics Engineer with a focus on autonomous systems for land / air vehicles and soft robots</li>\n</ul>\n<h2>Remaining work</h2>\n<p>The paths themselves also need some prioritisation based on success rates. For example there's not as many 'Machine Learning Engineer' roles in my area as 'Software Engineer' roles.</p>\n<p>I also need to factor in the difficulty of a particular field and how far do I want to get down that path.</p>\n<p>There seem to be a lot of paths so there's more work to do here to whittle these down.</p>\n<h2>Summary</h2>\n<p>Don't learn anything that doesn't align to a path. I might feel nice to play around with an obscure knowledge but your time is limited.</p>\n<p>Settling on a path / paths makes it easier to choose what you should learn next.</p>\n","title":"Choose a Learning Path","url":"learning-path","desc":"","updated":1611413229075,"created":1611408145496}},"__N_SSG":true}