{"pageProps":{"Post":{"id":"1fd285f4-f479-4157-be51-fb62896e47c1","contentHtml":"<h2>Lead chats or 1-2-1s</h2>\n<p>Having recently took on the role of tech lead for one of the squads, I wanted to document a bit about the process and system for running.</p>\n<h2>People vs. Performance</h2>\n<p>Manager-to-team-member chats are typically used in business for performance tracking and realignment. Most people who enter the industry have either worked in similar environments or never had the chance to experience such meetings.</p>\n<p>Let me say this, 1-2-1s are not for performance! Sure performance does come up, but it should never be the goal.</p>\n<p>The goals are related to personal growth and since everyone is different, every 1-2-1 is different.</p>\n<p>It's also a 'process meeting', not chit-chat. As a facilitator we need to have a range of tool to overcome road block and direct the meeting towards a positive outcome.</p>\n<h2>Intention and outcome</h2>\n<p>Before starting a 1-2-1 I set a goal for it. I walk into a meeting or click that Meet url knowing what I want to achieve from the meeting.</p>\n<p>Think hard about how the individual goals can help the team and vice versa.</p>\n<p>After you've run a few meetings you'll have a list of outcomes and because we deal with human beings these outcomes end up being seasonal.</p>\n<p>The ultimate goal is to help the individual reach clarity, set some short-term goals, and boots their motivation towards their new goals.</p>\n<h2>Prep</h2>\n<p>Review the persons past performance and make a note of feedback you want to share. This is an editing process and depends on the individual and their current 'season' - if someone is already unmotivated then withhold the difficult feedback.</p>\n<p>Review the individuals previous goals. Have they made progress? Have they completed the goal? Did they receive any feedback about the most recent goal?</p>\n<p>I also have a few canned questions to help drive the conversation:</p>\n<blockquote>\n<p>What have you enjoyed the most about the past sprint? Have you been having fun lately?</p>\n</blockquote>\n<p>Fun is crucial to fulfilling work and the question helps us focus on the positive parts of the sprint.</p>\n<blockquote>\n<p>What feedback do you have for me?</p>\n</blockquote>\n<p>This is a tricky question since everyone struggles to give feedback on the spot, but I repeat this each week. Usually I don't receive feedback, but when there's a bad week I always know about it.</p>\n<p>This question is also trust building. I ask it every week because I care about feedback and I want my team to know that. I also want them to know that we all make mistakes and that I really care about knowing when I've made mistakes.</p>\n<blockquote>\n<p>How are you feeling after last sprint?</p>\n</blockquote>\n<p>Simple question to put everyone at ease and have a bit of a laugh. This is a great question to warm people up to talking about home life or in general discuss current emotions.</p>\n<h2>During</h2>\n<p>Go where the conversation goes until you reach clarity. Once you have clarity state it, filter it together, and reach an agreement. Once you've agreed, choose another questions from above or continue.</p>\n<blockquote>\n<p>Here is some feedback... What do you think of it?</p>\n</blockquote>\n<p>Provide the feedback to the team member and ask for their opinion. I think of feedback as a tool for growth, so usually framed as such and always delivered positively.</p>\n<p>I tend to think of feedback of 'High five' and 'Watch out'.</p>\n<p>Link 'High five' feedback to the receivers skills or ways of working.</p>\n<p>When giving out 'Watch out' feedback make sure you also offer a clear path for adjustment and focus on habits and systems that can improve the situation.</p>\n<p>Adjust you delivery to the receiver: some people are open to chat whilst other requires some coaxing.</p>\n<p>Remember to have fun. There's a lot to think about, but were not robots - enjoy the conversation and company more than aiming to tick all the boxes.</p>\n<h2>Habits</h2>\n<p>Plan your meetings in advance and book the time in your calendar.</p>\n<p>Dedicate a specific time for the meetings, I find that 25 minutes is enough to get through most of the above. If a wider discussion is needed I'll book a follow-up.</p>\n<p>Try to batch your meetings together, it stops you from switching context. These meetings use up a lot of energy so its better to focus on them before you jump on the next tech task.</p>\n<h2>Other tools</h2>\n<p>Since we're talking about individual growth, it's important to try and build other tools that can help you maintain individual growth.</p>\n<p>One easy tool is a share scoring system. The system is only used for self-reflection is particularly useful for developers who can benchmark their technical and soft skills.</p>\n<p>Have the company policy on hand for those times when you get company policy questions.</p>\n<p>Build up a collection of useful resources and work through that as a team. This helps with clarity and lets everyone self-serve when they want to level up.</p>\n","url":"lead-chats","title":"Lead chats or 1-2-1s","desc":"","updated":1610908390475,"created":1610905332060}},"__N_SSG":true}